#pragma once

// Реализовать алгоритмы поиска, вставки, удаления элементов таблицы и распечатки таблицы
// и метод ре-хэширования таблицы при увеличении размера данных.

//Фамилия Имя Отчество - Ключ
//функция «середины квадрата» - Хэш-функция
//Квадратичное опробование - Метод разрешения коллизий

//В 5 лабе обязательно меню, в котором прописаны все действия
//1. записать информацию в пустую хеш таблицу (вызывается один раз)
//2. показ на экран хэш таблицы
//3. добавление в хеш таблицу
//4. функция удаления элементов
//5. функция поиска по заданному ключу  (ред.)


template<typename T>
class HashTable {

};