//Пусть слово - это последовательность от 1 до 8 символов, не включающая пробелов.
//Вводится n слов A1,...,An. Можно ли их переупорядочить так, чтобы получилась "цепочка",
//т.е. для каждого слова Aj его первая буква должна совпадать с последней буквой
//предыдущего слова, а последняя буква в Aj - с первой буквой последующего слова;
//соответственно последняя буква последнего слова должна совпадать с первой буквой
//первого слова. В цепочку входят все n слов без повторений.
//Дать ответ в виде "Можно"\"Нельзя".
//Если такое упорядочение возможно, то вывести какую-нибудь цепочку слов. Слова при выводе разделяются пробелами.


int main() {
    return 0;
}